[
  {
      "bookId": 1,
      "bookName": "The Night Circus",
      "author": "Erin Morgenstern",
      "image": "https://i.ibb.co/s3m6BP3/pngwing-1.png",
      "review": "The Night Circus is not just a novel, it's an enchanting experience that will transport you to a world of magic and wonder. Erin Morgenstern weaves a mesmerizing tale of love, rivalry, and illusion set against the backdrop of a mysterious and enchanting circus that arrives without warning and disappears just as mysteriously. The prose is lush and evocative, drawing you into the spellbinding world of the circus, where every tent holds a new marvel and every performer has a secret. As the competition between the two young magicians, Celia and Marco, intensifies, so does the enchantment of the circus itself, leading to a breathtaking climax that will leave you spellbound. With its richly imagined world, lyrical writing, and unforgettable characters, The Night Circus is a masterpiece of fantasy literature that will captivate readers of all ages.",
      "totalPages": 400,
      "rating": 4.8,
      "category": "Fantasy",
      "tags": ["Magic", "Romance"],
      "publisher": "Doubleday",
      "yearOfPublishing": 2011
  },
  {
      "bookId": 2,
      "bookName": "A Song of Ice and Fire",
      "author": "George R.R. Martin",
      "image": "https://i.ibb.co/37RxJ1c/kindpng-7318921.png",
      "review": "A Song of Ice and Fire is a sprawling epic that defies genre conventions and sets a new standard for fantasy literature. George R.R. Martin's masterful storytelling, richly detailed world-building, and complex characters make this series a must-read for any fan of the genre. Set in the fictional continents of Westeros and Essos, the series follows the power struggles between noble houses vying for control of the Iron Throne, as well as the looming threat of supernatural forces beyond the Wall. With its intricate plot twists, moral ambiguity, and unforgettable characters like Tyrion Lannister, Daenerys Targaryen, and Jon Snow, A Song of Ice and Fire has captured the imagination of millions of readers worldwide. Whether you're drawn to political intrigue, epic battles, or the mysteries of a world filled with magic and dragons, this series has something for everyone.",
      "totalPages": 694,
      "rating": 4.9,
      "category": "Fantasy",
      "tags": ["Epic Fantasy", "Political Intrigue"],
      "publisher": "Bantam Books",
      "yearOfPublishing": 1996
  },
  {
      "bookId": 3,
      "bookName": "The Goldfinch",
      "author": "Donna Tartt",
      "image": "https://i.ibb.co/FzpCNX6/kindpng-1064993.png",
      "review": "The Goldfinch is a richly layered and emotionally resonant novel that explores themes of loss, redemption, and the power of art to transform lives. Donna Tartt's prose is both elegant and immersive, drawing readers into the world of Theo Decker, a young boy who survives a tragic accident that kills his mother and sets him on a path of self-destruction and redemption. At the center of the novel is a painting, 'The Goldfinch' by Carel Fabritius, which becomes a symbol of Theo's longing for beauty and meaning in a world filled with chaos and despair. As Theo navigates the highs and lows of his life, from the glamorous art world of New York City to the seedy underbelly of the criminal underworld, he grapples with questions of identity, morality, and the nature of love. With its vividly drawn characters, evocative prose, and gripping plot, The Goldfinch is a literary masterpiece that will stay with you long after you turn the final page.",
      "totalPages": 864,
      "rating": 4.7,
      "category": "Fiction",
      "tags": ["Literary Fiction", "Art"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 2013
  },
  {
      "bookId": 4,
      "bookName": "The Martian",
      "author": "Andy Weir",
      "image": "https://i.ibb.co/wJDG2S4/kindpng-4022054-1.png",
      "review": "The Martian is a thrilling and scientifically accurate tale of survival and resilience that will keep you on the edge of your seat from beginning to end. Andy Weir's meticulous attention to detail and his ability to combine hard science with heart-pounding suspense make this novel a must-read for fans of science fiction and adventure. When astronaut Mark Watney is stranded on Mars after a dust storm forces his crew to evacuate, he faces seemingly insurmountable odds as he struggles to survive on a hostile planet with limited resources and no means of communication. As Watney uses his ingenuity and resourcefulness to overcome one obstacle after another, the tension builds to a gripping climax that will leave you breathless. With its compelling narrative, well-developed characters, and realistic portrayal of space travel, The Martian is a modern classic that will appeal to readers of all ages.",
      "totalPages": 369,
      "rating": 4.6,
      "category": "Science Fiction",
      "tags": ["Survival", "Adventure"],
      "publisher": "Crown Publishing Group",
      "yearOfPublishing": 2011
  },
  {
      "bookId": 5,
      "bookName": "The Kite Runner",
      "author": "Khaled Hosseini",
      "image": "https://i.ibb.co/10CJ4Vg/kindpng-81724-1.png",
      "review": "The Kite Runner is a haunting and powerful novel that explores themes of friendship, betrayal, and redemption against the backdrop of Afghanistan's turbulent history. Khaled Hosseini's prose is both lyrical and poignant, drawing readers into the lives of Amir and Hassan, two boys from different social classes who form an unlikely bond that is tested by jealousy, guilt, and the ravages of war. As the story unfolds against the backdrop of Afghanistan's political upheavals, from the fall of the monarchy to the rise of the Taliban, Hosseini paints a vivid portrait of a country torn apart by conflict and the enduring resilience of the human spirit. With its unforgettable characters, evocative setting, and powerful storytelling, The Kite Runner is a timeless classic that will stay with you long after you finish reading.",
      "totalPages": 371,
      "rating": 4.8,
      "category": "Fiction",
      "tags": ["Historical Fiction", "Drama"],
      "publisher": "Riverhead Books",
      "yearOfPublishing": 2003
  },
{
      "bookId": 6,
      "bookName": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "image": "https://i.ibb.co/6ZBQW9Y/kindpng-2193744-1.png",
      "review": "To Kill a Mockingbird is a timeless classic that explores themes of racial injustice, moral growth, and compassion in the American South. Harper Lee's poignant narrative follows Scout Finch, a young girl growing up in the racially charged town of Maycomb, Alabama, during the 1930s. As Scout navigates the complexities of her community, she learns valuable lessons about empathy, integrity, and standing up for what is right, especially when her father, attorney Atticus Finch, defends a black man falsely accused of raping a white woman. Through Scout's innocent yet insightful perspective, Lee masterfully exposes the hypocrisy and prejudice that permeate society while also celebrating the inherent goodness of humanity. With its powerful message and unforgettable characters, To Kill a Mockingbird continues to resonate with readers of all ages, reminding us of the importance of empathy and understanding in the pursuit of justice.",
      "totalPages": 324,
      "rating": 4.9,
      "category": "Classic",
      "tags": ["Literary Classic", "Social Justice"],
      "publisher": "J.B. Lippincott & Co.",
      "yearOfPublishing": 1960
  },
  {
      "bookId": 7,
      "bookName": "1984",
      "author": "George Orwell",
      "image": "https://i.ibb.co/dbD4C0x/kindpng-5624060-1.png",
      "review": "1984 is a dystopian masterpiece that offers a chilling glimpse into a totalitarian society ruled by surveillance, propaganda, and oppression. George Orwell's prophetic novel follows Winston Smith, a low-ranking member of the Party, as he rebels against the authoritarian regime of Big Brother in a world where freedom of thought is forbidden and truth is manipulated by those in power. As Winston navigates the dangers of dissent and the relentless scrutiny of the Thought Police, he grapples with questions of identity, truth, and the nature of reality. Orwell's haunting depiction of a society stripped of individuality and autonomy serves as a stark warning against the dangers of unchecked government control and the erosion of personal freedoms. With its timeless relevance and powerful message, 1984 remains a thought-provoking and unsettling exploration of the human condition under tyranny.",
      "totalPages": 328,
      "rating": 4.7,
      "category": "Dystopian",
      "tags": ["Totalitarianism", "Surveillance"],
      "publisher": "Secker & Warburg",
      "yearOfPublishing": 1949
  },
  {
      "bookId": 8,
      "bookName": "Pride and Prejudice",
      "author": "Jane Austen",
      "image": "https://i.ibb.co/rcmhYLJ/kindpng-2592315-1.png",
      "review": "Pride and Prejudice is a timeless romantic comedy of manners that continues to captivate readers with its wit, charm, and unforgettable characters. Jane Austen's masterful storytelling follows the spirited Elizabeth Bennet as she navigates the pitfalls of love, social status, and family expectations in Regency-era England. When the proud and aloof Mr. Darcy enters her life, Elizabeth's initial prejudices are challenged as she discovers the true nature of his character and her own heart. As misunderstandings abound and societal conventions threaten to keep them apart, Elizabeth and Darcy must confront their own pride and prejudice to find their happily ever after. With its sparkling dialogue, sharp social commentary, and timeless themes of love and redemption, Pride and Prejudice remains a beloved classic that delights and inspires readers of all generations.",
      "totalPages": 432,
      "rating": 4.8,
      "category": "Classic",
      "tags": ["Romance", "Social Satire"],
      "publisher": "T. Egerton, Whitehall",
      "yearOfPublishing": 1813
  },
{
  "bookId": 9,
  "bookName": "The Great Gatsby",
  "author": "F. Scott Fitzgerald",
  "image": "https://i.ibb.co/DV0BMnN/kindpng-4945926-1.png",
  "review": "The Great Gatsby is a timeless classic that explores the allure of the American Dream and the emptiness that often accompanies it. Set against the backdrop of the Roaring Twenties, F. Scott Fitzgerald's masterful novel follows the enigmatic Jay Gatsby as he pursues wealth, status, and the love of his life, Daisy Buchanan. Through the eyes of narrator Nick Carraway, readers are drawn into the lavish world of East and West Egg, where the promise of prosperity and excess conceals the moral decay and disillusionment lurking beneath the surface. As Gatsby's extravagant parties and romantic gestures mask his inner longing for acceptance and belonging, the novel reveals the tragic consequences of his relentless pursuit of an unattainable dream. With its lyrical prose, evocative imagery, and profound themes of love, loss, and the corrupting influence of wealth, The Great Gatsby continues to resonate with readers as a poignant meditation on the fleeting nature of happiness and the enduring power of hope.",
  "totalPages": 180,
  "rating": 4.7,
  "category": "Classic",
  "tags": ["American Dream", "Romance"],
  "publisher": "Charles Scribner's Sons",
  "yearOfPublishing": 1925
}
]
